# 1
family = ["Miriani,Lazare,Giorgi,Nana"]
print(family)
# 2
fruit = ["Apple", "Orange", "Pear", "Lemon"]
fav_fruits = fruit[1]
print("I love " + fav_fruits)
# Mutable (ცვალებადი)
# ისეთი რაღაცები, რისი შეცვლაც შექმნის მერეც შეგვიძლია.
# მაგალითად: სია (list). სიაში შეგვიძლია ახალი ნივთი ჩავწეროთ ან ძველი წავშალოთ.

# Immutable (უცვლელი)
# ისეთი რაღაცები, რასაც შექმნის მერე საერთოდ ვერ შევცვლით.
# მაგალითად: სიტყვა (string) ან რიცხვი (int). თუ მათ შეცვლას ვცდით, კომპიუტერი მეხსიერებაში ახალ რაღაცას ქმნის.

# სია (List)
# ბევრი ნივთის ან სიტყვის ერთად შენახვა ერთ პატარა ყუთში (ცვლადში).
# რაში გვჭირდება: ნივთების, სახელების ან ქულების ერთად დასაწერად (მაგალითად, საყიდლების სია).

# ინდექსირება (Indexing)
# სიაში ნივთების პოვნა მათი ნომრების მიხედვით.
# მთავარი წესი: პითონში ათვლას ვიწყებთ არა 1-დან, არამედ 0-დან (პირველი ნივთის ნომერი არის 0).

# 1. რა არის სია (List)?
# სია არის ბევრი ნივთის, სიტყვის ან რიცხვის ერთად შენახვა ერთ პატარა ყუთში (ცვლადში).

# 2. რაში შეიძლება გამოვიყენოთ სია?
# ჩემი აზრით, სია გამოდგება თამაშებში ინვენტარის (ჩანთის) გასაკეთებლად, 
# სადაც მოთამაშის ნივთები ინახება. ასევე საყიდლების სიის ან ლიდერბორდზე 
# მოთამაშეების სახელების და ქულების ერთად დასაწერად.

# 3. რა არის ინდექსირება (Indexing)?
# ინდექსირება არის სიაში ჩაყრილი ნივთების პოვნა მათი რიგითი ნომრების მიხედვით.
# მთავარი წესი: პითონში ათვლა ყოველთვის 0-დან იწყება და არა 1-დან! 
# პირველი ნივთის ნომერია 0, მეორესი - 1, მესამესი - 2 და ასე შემდეგ.
