# 1

# if აკეთებს თუ რაღაცა სწორია, შეასრულოს ნებისმიერი რამე.
# elif არის if - ისავით მაგრამ განსხვავება ისაა თუ როგორ ამოწმებს კომპიუტერი პირობებს, მოწმდება როცა მცდარია.
# else თუ არასწორია პირობა if - ი და elif - იც არ შესრულდება.

# 2

# if-else - ში განსხვავებაა if-elif-else - თან, if else - ი გააკეთბს რამეს თუ არის პირობა True და else გააკეთებს თუ პირობა არასწორი იქნება სხვა რამე გააკეთოს, if - ის ნაცვლად.
# if-elif-else - ში elif - ს რო ვამატებთ, რამე თუ არასწორია კომპიუტერი ეუბნება მაინც გააკეთოს პირობა, დანარჩენი იგივეა. 

# 3

age = int(input("შემოიყვანე შენი ასაკი: " ))
if age <= 12:
    print("ბავშვი")
elif age <= 19:
    print("თინეიჯერი")
else:
    print("ზრდასრული")

# 4

grade = int(input("შემოიყვანეთ სტუდენტის მიღებული ქულა: " ))
if 90 <= grade <= 100:
    grade = "A"
elif 80 <= grade < 90:
    grade = "B"
elif 70 <= grade < 80:
    grade = "C"
elif 60 <= grade < 70:
    grade = "D"
elif 0 <= grade < 60:
    grade = "F"
else:
    print("Try Again")
print("The grade is:", grade)